In [2]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [3]:
df =pd.DataFrame({'a':[1,2,3,4],
       'b':[5,6,7,8],
       'c':['Mayur','Patan','Kuldeep','Uday']
      })

In [4]:
file=pd.read_csv('taxonomy.csv')

In [5]:
#(1) .fillna()

file.fillna('0')

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency         0                     0
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

In [6]:
#(2) .drop()

file.drop('parent_id',axis=1)

    taxonomy_id                          name           parent_name
0           101                     Emergency                   NaN
1        101-01             Disaster Response             Emergency
2        101-02                Emergency Cash             Emergency
3     101-02-01             Help Pay for Food        Emergency Cash
4     101-02-02       Help Pay for Healthcare        Emergency Cash
..          ...                           ...                   ...
285   111-01-07              Workplace Rights  Advocacy & Legal Aid
286      111-02                     Mediation                 Legal
287      111-03                        Notary                 Legal
288      111-04                Representation                 Legal
289      111-05  Translation & Interpretation                 Legal

[290 rows x 3 columns]

In [7]:
#(3) .set_index()

file.set_index('taxonomy_id')

                                     name parent_id           parent_name
taxonomy_id
101                             Emergency       NaN                   NaN
101-01                  Disaster Response       101             Emergency
101-02                     Emergency Cash       101             Emergency
101-02-01               Help Pay for Food    101-02        Emergency Cash
101-02-02         Help Pay for Healthcare    101-02        Emergency Cash
...                                   ...       ...                   ...
111-01-07                Workplace Rights    111-01  Advocacy & Legal Aid
111-02                          Mediation       111                 Legal
111-03                             Notary       111                 Legal
111-04                     Representation       111                 Legal
111-05       Translation & Interpretation       111                 Legal

[290 rows x 3 columns]

In [8]:
#(4) .date_range

date=pd.date_range(start='2023-01-01',end='2023-12-31')
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10',
               ...
               '2023-12-22', '2023-12-23', '2023-12-24', '2023-12-25',
               '2023-12-26', '2023-12-27', '2023-12-28', '2023-12-29',
               '2023-12-30', '2023-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [9]:
#(5) .apply()

file['Length'] = file['name'].apply(len)
file

,taxonomy_id,name,parent_id,parent_name,Length
0,101,Emergency,NaN,NaN,9
1,101-01,Disaster Response,101,Emergency,17
2,101-02,Emergency Cash,101,Emergency,14
3,101-02-01,Help Pay for Food,101-02,Emergency Cash,17
4,101-02-02,Help Pay for Healthcare,101-02,Emergency Cash,23
...,...,...,...,...,...
285,111-01-07,Workplace Rights,111-01,Advocacy & Legal Aid,16
286,111-02,Mediation,111,Legal,9
287,111-03,Notary,111,Legal,6
288,111-04,Representation,111,Legal,14
289,111-05,Translation & Interpretation,111,Legal,28

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [10]:
df=pd.DataFrame({'A':[1,2,3],
                 'B':[4,5,6],
                 'C':[7,8,9]
                })

def for_indexing(df):
    
    df = df.reset_index()
    indexx = df.index*2+1
    df = df.set_index(indexx)
    return df

In [11]:
df1 = for_indexing(df)

In [12]:
df1

   index  A  B  C
1      0  1  4  7
3      1  2  5  8
5      2  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [13]:
df=pd.DataFrame({'Values':[1,9,3],
                 'B':[4,5,6],
                 'C':[7,8,9]
                })

In [14]:
def for_summ(df):
    for_first_three=df['Values'].head(3)
    sum_of_three=for_first_three.sum()
    return sum_of_three

In [15]:
summ=for_summ(df)
summ

13

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [16]:
df=pd.DataFrame({'Text':['Hi,How Are You?','Hi,I Am Fine','Nice To Meet You!','Thank You!!']
                })

In [17]:
def count(df):
    df['Word_Count']=df['Text'].apply(lambda x:len(x.split()))

In [18]:
new=count(df)
df

                Text  Word_Count
0    Hi,How Are You?           3
1       Hi,I Am Fine           3
2  Nice To Meet You!           4
3        Thank You!!           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

* DataFrame.size() 

--> This function is used to get information about dataframe.

--> The answere of it will be multiplication of number of rows and number of columns.

In [19]:
df=pd.DataFrame({'A':[1,2,3],
                 'B':[4,5,6],
                 'C':[7,8,9]
                })
print(df.size)

9

* DataFrame.shape() 

--> This function is also used to get infromation .

--> I gives us the number of columns and the number of rows in the form of tuple.

In [20]:
df=pd.DataFrame({'A':[1,2,3],
                 'B':[4,5,6],
                 'C':[7,8,9],
                 'D':[11,22,33]
                })
print(df.shape)

(3, 4)

Q6. Which function of pandas do we use to read an excel file?

* We use ' read_excel(___.xlsx) ' function to read excel file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [21]:
df=pd.DataFrame({'Email':['mihir@gmail.com','patan.14@gmail.com','knuk11@gmail.com','mek8_4@gmail.com']})

In [22]:
name = df['Email'].apply(lambda x:x.split('@')[0])

In [23]:
df['Username']=name

In [24]:
df

                Email  Username
0     mihir@gmail.com     mihir
1  patan.14@gmail.com  patan.14
2    knuk11@gmail.com    knuk11
3    mek8_4@gmail.com    mek8_4

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [25]:
df=pd.DataFrame({'A':[1,9,3,7],
                 'B':[4,5,6,1],
                 'C':[7,8,9,2]
                })

In [26]:
df

   A  B  C
0  1  4  7
1  9  5  8
2  3  6  9
3  7  1  2

In [27]:
def test(df):
    
    r = df[(df['A'] > 5) & (df['B'] < 10)]
    
    return r

In [28]:
calll = test(df)
calll

   A  B  C
1  9  5  8
3  7  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [29]:
df = pd.DataFrame({'Values':[2,4,5,7,9,12]})

In [40]:
def stath(df):
    
    for_mean = df['Values'].mean()
    
    for_median = df['Values'].median()
    
    for_sd = df['Values'].std()
    
    return ('Mean:',for_mean),('Median:',for_median),('Standard Deviation:',for_sd)

In [41]:
for_ans = stath(df)
for_ans

(('Mean:', 6.5), ('Median:', 6.0), ('Standard Deviation:', 3.6193922141707713))

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [42]:
date = pd.date_range(start='2023-04-01',end='2023-04-07')

In [60]:
df1 = pd.DataFrame({'Sales':[100,200,300,400,500,600,700],
                   'Date':date
                  })

In [83]:
df1['MovingAverage'] = df1['Sales'].rolling(window=7,min_periods=1).mean()

In [84]:
df1

   Sales       Date  MovingAverage
0    100 2023-04-01          100.0
1    200 2023-04-02          150.0
2    300 2023-04-03          200.0
3    400 2023-04-04          250.0
4    500 2023-04-05          300.0
5    600 2023-04-06          350.0
6    700 2023-04-07          400.0

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [85]:
df = pd.DataFrame({'Date':date})

In [119]:
def wek(df):
    
    df['Weekday'] = df['Date'].dt.day_name()
    
    return df

In [120]:
df

        Date    Weekday
0 2023-04-01   Saturday
1 2023-04-02     Sunday
2 2023-04-03     Monday
3 2023-04-04    Tuesday
4 2023-04-05  Wednesday
5 2023-04-06   Thursday
6 2023-04-07     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [121]:
date2 = pd.date_range(start='2023-01-01',end='2023-12-31')

In [122]:
df = pd.DataFrame({'Date':date2})

In [128]:
def dat(df):
    
    for_select = df.loc[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    
    return for_select

In [129]:
kal = dat(df)
kal

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

--> The library 'pandas' is the first and foremost necessary library that needs to be imported to use the basic functionans of pandas.